app/views/employees/index.html.erb

SELECT DISTINCT "employees"."department" FROM "employees"
SELECT DISTINCT "employees"."position" FROM "employees"
---
              class: "form-control me-2 search-field rounded-0 w-auto" %>
          <%= f.select :department_eq, Employee.distinct.pluck(:department),
              { include_blank: "All Departments" },
              class: "form-select me-2 filter-field rounded-0 w-auto" %>
          <%= f.select :position_eq, Employee.distinct.pluck(:position),
              { include_blank: "All Positions" },
              class: "form-select me-2 filter-field rounded-0 w-auto" %>