app/controllers/admins_controller.rb

  def index
    @admins = User.where(role: 'admin')
---
SELECT "users".* FROM "users" WHERE "users"."role" = 'admin'

 def destroy
    @admin = User.find(params[:id]) # Find the admin by ID
    if @admin.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 2

  def create
    @admin = User.new(admin_params)
    @admin.role = 'admin' # Set the role explicitly to admin
    if @admin.save
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "role") VALUES ('roshnivyas74@gmail.com', '$2a$12$pa80HOXRPLHPjVxlhrQlvutEQICd5U1NWWiHI0rgFAV6SnPtj09.S', NULL, NULL, NULL, '2025-01-13 10:29:54.140049', '2025-01-13 10:29:54.140049', 'admin') RETURNING "id"