app/controllers/attendances_controller.rb

SELECT "attendances".* FROM "attendances" WHERE "attendances"."employee_id" = 2 ORDER BY "attendances"."date" DESC
---
  def index
    @attendances = @employee.attendances.order(date: :asc)

INSERT INTO "attendances" ("employee_id", "check_in", "check_out", "date", "status", "created_at", "updated_at") VALUES (6, '2025-01-06 11:19:00', '2025-01-06 21:34:00', '2025-01-06', 'Present', '2025-01-06 13:30:08.006674', '2025-01-06 13:30:08.006674') RETURNING "id"
---
  def create
    @attendance = @employee.attendances.new(attendance_params)
    if @attendance.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = 2 LIMIT 1
---
  def set_employee
    @employee = Employee.find(params[:employee_id])