app/controllers/employees_controller.rb

SELECT DISTINCT "employees".* FROM "employees" ORDER BY "employees"."first_name" ASC
---
  def index
  @q = Employee.ransack(params[:q])
  @employees = @q.result(distinct: true).order(:first_name)

INSERT INTO "employees" ("first_name", "last_name", "email", "position", "department", "salary", "hired_on", "created_at", "updated_at") VALUES ('Amaan', 'Tazak', 'amaantazak24@gmail.com', 'Junior Developer', 'ROR', 15000.0, '2024-10-04', '2025-01-03 16:39:34.695365', '2025-01-03 16:39:34.695365') RETURNING "id"
---
  def create
    @employee = Employee.new(employee_params)
    if @employee.save

UPDATE "employees" SET "salary" = 85000.0, "updated_at" = '2025-01-08 14:22:10.632560' WHERE "employees"."id" = 6
---
def update
    if @employee.update(employee_params)

DELETE FROM "employees" WHERE "employees"."id" = 5
---
 def destroy
  if @employee.destroy

SELECT "employees".* FROM "employees" WHERE "employees"."id" = 3 LIMIT 1
---
    def set_employee
      @employee = Employee.find(params[:id])