app/controllers/homes_controller.rb

SELECT DISTINCT "employees".* FROM "employees" ORDER BY "employees"."first_name" ASC
---
  def index
    @q = Employee.ransack(params[:q])
    @employees = @q.result(distinct: true).order(:first_name)